{
    "Home": "Inicio",
    "Complexity": "Complejidad",
    "Dashboard": "Gráficos",
    "Meta-Feature": "Meta-Características",
    "Select-dataset": "Seleccionar conjunto de datos ...",
    "Drag-drop": "Arrastra y suelta o selecciona archivos",
    "Msg-load-file": "No se han agregado los datos para realizar las funcionalidades, carga un archivo para continuar",
    "Welcome": "¡Bienvenido!",
    "welcome-card": "Esta aplicación está diseñada para hacer que el análisis y la visualización de datos sean tanto eficientes como precisos. Con nuestras herramientas, puedes crear fácilmente gráficos personalizados, calcular metacaracterísticas y evaluar la complejidad de tus datos de manera simple e intuitiva. Nuestro objetivo es proporcionarte las herramientas necesarias para profundizar en tu análisis, permitiéndote seleccionar las técnicas de evaluación y algoritmos más apropiados para tus necesidades.",
    "Download-CSV": "Descargar CSV",
    "Unsoported-file": "Formato de archivo no compatible. Cargue un archivo CSV, EXCEL o ARFF.",
    "No-data": "No hay datos cargados",
    "Go-back": "Volver al inicio",
    "Select-Input-Feature": "Seleccionar Característica de Entrada:",
    "Select-Class-Feature": "Seleccionar Característica de Clase:",
    "Select-Graph-Type": "Seleccionar Tipo de Gráfico:",
    "Generate-Plot": "Generar Gráfico",
    "Plot-Alert": "Please select both input features and a class feature.",
    "Scatter-Plot": "Gráfico de Dispersión",
    "Pie-Chart": "Gráfico de Pastel",
    "Histogram": "Histograma",
    "Line-Chart": "Gráfico de Líneas",
    "Box-Plot": "Diagrama de Caja",
    "Heatmap": "Mapa de Calor",
    "Calculate-Measures": "Calcular medidas",
    "Calculate-Meta-Features": "Calcular Meta-Características",
    "Meta-Features-of-the-group": "Meta-Características del grupo",
    "f1": "Máxima Relación de Discriminación de Fisher: Mide qué tan bien están separadas las clases en relación con su variabilidad interna. Valores más altos indican que las clases están bien separadas, lo que facilita la clasificación.",
    "f1v": "Relación de Discriminación de Fisher Vector Direccional: Una variante de la Relación de Discriminación de Fisher que considera las direcciones de los vectores. Valores más bajos pueden indicar una mayor dificultad en la separación de clases.",
    "f2": "Superposición de los Cuadrados Delimitadores por Clase: Mide la superposición entre los cuadrados delimitadores de diferentes clases. Valores más altos indican más superposición, sugiriendo que las clases están menos separadas y, por lo tanto, es más difícil clasificarlas correctamente.",
    "f3": "Máxima Eficiencia de Características Individuales: Evalúa la eficiencia de la mejor característica individual para separar clases. Valores cercanos a 1 indican que al menos una característica separa muy bien las clases.",
    "f4": "Eficiencia Colectiva de Características: Similar a f3, pero mide la eficiencia combinada de todas las características para separar clases. Un valor cercano a 1 indica que el conjunto de características es altamente efectivo para la separación de clases.",
    "l1": "Suma de la Distancia de Error por Programación Lineal: Mide la dificultad de separar clases utilizando un clasificador lineal a través de programación lineal. Valores más altos indican que encontrar una separación lineal es más desafiante.",
    "l2": "Tasa de Error del Clasificador Lineal: La tasa de error de clasificación de un clasificador lineal simple. Valores más altos indican que el problema es más difícil desde la perspectiva de un clasificador lineal.",
    "l3": "No linealidad del Clasificador Lineal: Mide la no linealidad del problema respecto a un clasificador lineal. Valores más altos indican una mayor no linealidad y, por lo tanto, más dificultad para los clasificadores lineales.",
    "n1": "Fracción de Puntos en la Frontera: La proporción de instancias que están cerca de la frontera de decisión. Un valor alto sugiere que muchas instancias están cerca de la frontera entre clases, lo que puede complicar la clasificación.",
    "n2": "Relación de Distancia de Vecinos Más Cercanos Intra/Extra Clase: La relación de las distancias de vecinos más cercanos dentro y fuera de la clase. Un valor alto indica que las instancias dentro de la misma clase están más cerca entre sí que de las de diferentes clases, sugiriendo buena separación de clases.",
    "n3": "Tasa de Error del Clasificador de Vecinos Más Cercanos: La tasa de error de un clasificador de k vecinos más cercanos (k-NN). Un valor alto indica que un clasificador k-NN tiene dificultades para distinguir entre clases.",
    "n4": "No linealidad del Clasificador de Vecinos Más Cercanos: Mide la no linealidad del problema con respecto a un clasificador k-NN. Valores altos sugieren que el problema no se ajusta bien a la clasificación basada en proximidad.",
    "t1": "Fracción de Hipersuperficies Cubriendo Datos: La proporción de los datos cubiertos por las hipersuperficies mínimas necesarias para cubrir todas las instancias de datos. Un valor alto puede indicar que los datos están bien concentrados.",
    "lsc": "Cardinalidad del Conjunto Local: Mide el número promedio de vecinos de la misma clase en el entorno local de cada instancia. Valores altos indican una alta densidad local de la misma clase, facilitando la clasificación.",
    "density": "Densidad de Clase: Mide la densidad de la clase en el espacio de características. Valores altos sugieren que las instancias dentro de cada clase están densamente agrupadas.",
    "clsCoef": "Coeficiente de Agrupamiento: El coeficiente de agrupamiento mide la probabilidad de que dos vecinos de una instancia también sean vecinos entre sí. Valores altos indican una estructura de agrupamiento fuerte, lo que puede simplificar la clasificación.",
    "hubs": "Hubness: Mide la prevalencia de hubs, que son puntos de datos que frecuentemente aparecen como vecinos de otros puntos. Un valor alto puede indicar que algunos puntos son centrales en el espacio de características, afectando potencialmente la dificultad del problema.",
    "t2": "Número Promedio de Dominios Discretos: El número promedio de dominios discretos en los que se dividen los valores de las características. Valores bajos sugieren que los atributos son más continuos.",
    "t3": "Entropía Normalizada del Dominio Discreto: Mide la entropía normalizada del dominio de características discretas. Un valor bajo indica menos incertidumbre o variabilidad en las características discretas.",
    "t4": "Información Mutua: Mide la cantidad de información compartida entre las características y las etiquetas de clase. Un valor bajo indica que las características son menos informativas con respecto a la clase objetivo.",
    "c1": "Fracción de Características No Informativas: La proporción de características que no proporcionan información relevante para la clasificación. Un valor alto indica que hay muchas características redundantes o irrelevantes.",
    "c2": "Dependencia de Características: Mide la dependencia entre características. Un valor alto sugiere que las características están altamente correlacionadas entre sí, lo que puede afectar la capacidad de generalización del modelo.",
    "Metric": "Métrica",
    "Value": "Valor",
    "Linearity-measures": "Medidas de linealidad",
    "Feature-based-measures": "Medidas basadas en características",
    "Class-imbalance-measures": "Medidas de desequilibrio de clases",
    "Dimensionality-measures": "Medidas de dimensionalidad",
    "Network-measures": "Medidas de red",
    "Neighborhood-measures": "Medidas de vecindario",
    "attr_conc.mean": "Concentración de los atributos, que mide cuántos valores distintos tienen los atributos en el conjunto de datos. La media es el promedio, y la desviación estándar (Sd) es la desviación estándar de esta concentración.",
    "attr_conc.sd": "Concentración de los atributos, que mide cuántos valores distintos tienen los atributos en el conjunto de datos. La media es el promedio, y la desviación estándar (Sd) es la desviación estándar de esta concentración.",
    "attr_ent.mean": "Entropía de los atributos. La entropía mide la cantidad de incertidumbre o aleatoriedad en los valores de los atributos. La media es el promedio.",
    "attr_ent.sd": "Entropía de los atributos. La entropía mide la cantidad de incertidumbre o aleatoriedad en los valores de los atributos. La desviación estándar (Sd) es la desviación estándar.",
    "attr_to_inst": "Razón entre el número de atributos y el número de instancias en el conjunto de datos.",
    "can_cor.mean": "Correlación canónica. Mide la relación lineal entre dos conjuntos de variables (por ejemplo, atributos y clases). La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la correlación canónica.",
    "can_cor.sd": "Correlación canónica. Mide la relación lineal entre dos conjuntos de variables (por ejemplo, atributos y clases). La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la correlación canónica.",
    "cat_to_num": "Razón entre el número de atributos categóricos y el número de atributos numéricos.",
    "class_conc.mean": "Concentración de clases, similar a attr_conc, pero aplicada a las clases. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de esta concentración.",
    "class_conc.sd": "Concentración de clases, similar a attr_conc, pero aplicada a las clases. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de esta concentración.",
    "class_ent": "Entropía de clase, que mide la incertidumbre en la distribución de clases.",
    "cor.mean": "Correlación entre atributos, que mide la fuerza y dirección de la relación lineal entre pares de atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la correlación.",
    "cor.sd": "Correlación entre atributos, que mide la fuerza y dirección de la relación lineal entre pares de atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la correlación.",
    "cov.mean": "Covarianza entre atributos, que mide la variabilidad conjunta de dos variables aleatorias. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la covarianza.",
    "cov.sd": "Covarianza entre atributos, que mide la variabilidad conjunta de dos variables aleatorias. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la covarianza.",
    "eigenvalues.mean": "Valores propios de la matriz de covarianza, que reflejan la cantidad de varianza explicada por cada componente principal. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de estos valores propios.",
    "eigenvalues.sd": "Valores propios de la matriz de covarianza, que reflejan la cantidad de varianza explicada por cada componente principal. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de estos valores propios.",
    "eq_num_attr": "Número de atributos que tienen el mismo número de valores distintos.",
    "freq_class.mean": "Frecuencia de clase, la media es el promedio, y la desviación estándar (sd) es la desviación estándar de las frecuencias de clase en el conjunto de datos.",
    "freq_class.sd": "Frecuencia de clase, la media es el promedio, y la desviación estándar (sd) es la desviación estándar de las frecuencias de clase en el conjunto de datos.",
    "g_mean.mean": "Media geométrica de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media geométrica.",
    "g_mean.sd": "Media geométrica de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media geométrica.",
    "gravity": "Centroide o centro de gravedad de los datos, un punto en el espacio que representa el centro de masa de todos los puntos de datos.",
    "h_mean.mean": "Media armónica de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media armónica.",
    "h_mean.sd": "Media armónica de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media armónica.",
    "inst_to_attr": "Razón entre el número de instancias y el número de atributos en el conjunto de datos.",
    "iq_range.mean": "Rango intercuartílico de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar del rango intercuartílico.",
    "iq_range.sd": "Rango intercuartílico de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar del rango intercuartílico.",
    "joint_ent.mean": "Entropía conjunta de pares de atributos, que mide la incertidumbre combinada. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la entropía conjunta.",
    "joint_ent.sd": "Entropía conjunta de pares de atributos, que mide la incertidumbre combinada. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la entropía conjunta.",
    "kurtosis.mean": "Curtosis de los valores de los atributos, que mide la agudeza o aplanamiento de la distribución. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la curtosis.",
    "kurtosis.sd": "Curtosis de los valores de los atributos, que mide la agudeza o aplanamiento de la distribución. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la curtosis.",
    "lh_trace": "Traza de la matriz de la razón de varianza (razón de la varianza dentro de la clase a la varianza total). Mide la separabilidad de clases en términos de varianza.",
    "mad.mean": "Desviación absoluta media de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la desviación absoluta media.",
    "mad.sd": "Desviación absoluta media de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la desviación absoluta media.",
    "max.mean": "Valor máximo de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de los valores máximos.",
    "max.sd": "Valor máximo de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de los valores máximos.",
    "mean.mean": "Media de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media de los valores.",
    "mean.sd": "Media de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media de los valores.",
    "median.mean": "Mediana de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de las medianas.",
    "median.sd": "Mediana de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de las medianas.",
    "min.mean": "Valor mínimo de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de los valores mínimos.",
    "min.sd": "Valor mínimo de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de los valores mínimos.",
    "mut_inf.mean": "Información mutua entre pares de atributos, que mide la dependencia entre ellos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la información mutua.",
    "mut_inf.sd": "Información mutua entre pares de atributos, que mide la dependencia entre ellos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la información mutua.",
    "nr_attr": "Número de atributos en el conjunto de datos.",
    "nr_bin": "Número de atributos binarios (que tienen solo dos valores posibles).",
    "nr_cat": "Número de atributos categóricos en el conjunto de datos.",
    "nr_class": "Número de clases en el conjunto de datos.",
    "nr_cor_attr": "Número de atributos correlacionados, generalmente aquellos con una correlación por encima de un umbral.",
    "nr_disc": "Número de atributos discretos, aquellos que tienen un número limitado de valores.",
    "nr_inst": "Número de instancias en el conjunto de datos.",
    "nr_norm": "Número de atributos normalizados (escalados).",
    "nr_num": "Número de atributos numéricos en el conjunto de datos.",
    "nr_outliers": "Número de valores atípicos en el conjunto de datos.",
    "ns_ratio": "Razón entre el número de instancias de la clase más común y la clase menos común.",
    "num_to_cat": "Razón entre el número de atributos numéricos y categóricos.",
    "p_trace": "Traza de la matriz de correlación. Refleja la suma de las varianzas explicadas por los componentes principales.",
    "range.mean": "Rango de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de los rangos.",
    "range.sd": "Rango de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de los rangos.",
    "roy_root": "Raíz de Roy, una estadística relacionada con la máxima correlación canónica.",
    "sd.mean": "Desviación estándar de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la desviación estándar.",
    "sd.sd": "Desviación estándar de los valores de los atributos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la desviación estándar.",
    "sd_ratio": "Razón entre la desviación estándar dentro de las clases y la desviación estándar total.",
    "skewness.mean": "Asimetría de los valores de los atributos, que mide el grado de asimetría en la distribución.",
    "skewness.sd": "Asimetría de los valores de los atributos, que mide el grado de asimetría en la distribución.",
    "sparsity.mean": "Esparcimiento de los atributos, que mide la proporción de valores nulos o cero en los datos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar del esparcimiento.",
    "sparsity.sd": "Esparcimiento de los atributos, que mide la proporción de valores nulos o cero en los datos. La media es el promedio, y la desviación estándar (sd) es la desviación estándar del esparcimiento.",
    "t_mean.mean": "Media truncada de los valores de los atributos. La media truncada se calcula excluyendo un porcentaje de los valores más extremos (por ejemplo, los más altos y más bajos). La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media truncada.",
    "t_mean.sd": "Media truncada de los valores de los atributos. La media truncada se calcula excluyendo un porcentaje de los valores más extremos (por ejemplo, los más altos y más bajos). La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la media truncada.",
    "var.mean": "Varianza de los valores de los atributos. La varianza mide la dispersión de los datos alrededor de la media. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la varianza.",
    "var.sd": "Varianza de los valores de los atributos. La varianza mide la dispersión de los datos alrededor de la media. La media es el promedio, y la desviación estándar (sd) es la desviación estándar de la varianza.",
    "w_lambda": "Estadístico de Wilks' Lambda, utilizada en análisis multivariado para medir la separación entre grupos. Valores más bajos indican mejor separación entre clases."
}

